{
  "HOME": "Home",
  "RESUME": "Resume",
  "PORTFOLIO": "Portfolio",
  "CERT": "Certifications",
  "CONTACT": "Contact",
  "FOOT": "<hr>&copy; 2024 Created in Angular by Eduardo Martínez Ramírez",
  "TITLE": "<b>Hello!, I'm <i>Eduardo Martínez.</i></b> Welcome to My Website",


  "HT1": "<a href='assets/Edi-1.jpg' alt='Eduardo'>¿Who am I?</a>",
  "HS1": "I'm a web and multiplataform developer, in local and in the cloud",
  "HC1": "As a passionate software developer, I am deeply enthusiastic about creating and developing software applications. I am constantly learning and experimenting with new technologies and approaches, and I have a strong desire to create innovative and effective solutions to complex problems. I am driven by my curiosity and love for problem-solving, and I am committed to producing high-quality, well-designed software that meets the needs of users.<br><br>My specialty covers the creation of dynamic websites and the development of applications for various platforms. I am always looking for opportunities to expand my skills and face new challenges in the field of information technology<.br>I do the entire development cycle, from the conception of the design of the visible part (<i>frontend</i>), to the management of business databases (<i>backend</i>), going through all the stages of development of the logic distributed between the server and the client.<br><br>I have initiative in the resolution of complex problems. I am very good at collaborative work, and I have experience in continuing other outside developments.<br><br>I'm a spaniard, born in Madrid on August 23, 1992.",
  "HT2": "Know-how",
  "HS2": "Full-stack Web Develpper",
  "HC2": "Front-end develoment of dynamic Webs with Angular, React & Nodejs.<br>Back-end development with .NET, C#, Java, PHP.",
  "HT2_": "",
  "HS2_": "System services in AWS and Azure clouds",
  "HC2_": ".NET, C#, Java and PHP programming, and database management with MySQL, SQLServer, SQlite.",
  "HT2__": "",
  "HS2__": "Cross-platform application developer",
  "HC2__": "Mobile apps for Android.",
  
  "HT3": "Skills",
  "HS3": "I've experience in <u>add ICONS</u>:",
  "HC3": "<ul><li>.NET & C#</li><li>Java & Spring</li><li>HTML, CSS & Bootstrap</li><li>JS, Node.js & Angular</li><li>APIs & Postman</li><li>PHP & WordPress</li><li>Android</li><li>Python</li><li>SQLServer, MySQL, SQLite & MongoDB</li><li>Git, GitHub & GH-Pages</li><li>AWS & Azure</li><li>I stay updated on HW progress (especially graphics cards), and AI and videogame SW.</li></ul>",

  "RT1": "Experience",
  "RS1": "04/2023 - 09/2023<br>Full-stack developper in <i><b><u>intuye</u></b></i>",
  "RC1": "Development of a document management system with PHP, HTML, CSS and JavaScript with the following functionalities:<br><ul><li>Implementing a web platform with registration and authentication functions linked to a MySQL database using XAMPP.</li><li>Designing a user management system with customizable roles and privileges.</li><li>Creation of a file manager, which allows: uploading, deleting, sorting, labeling files.</li></ul>",
  "RC1_": "Development of an e-commerce website with .NET Core 6 and Azure <br><ul><li>ImplUsing ASP.NET Core and Razor Pages, implementing a microservices architecture with Azure and API management using Postman.</li> <li>Using Azure Functions to implement serverless functions, reducing infrastructure cost.</li></ul>",

  "RT2": "Professional studies",
  "RS2": "03/2024 - 07/2024<br>Curso de programador de sistemas en AWS<br>Centro Tajamar (510 h)",
  "RC2": "<ul><li>Desarrollo de aplicaciones en la nube utilizando AWS SDKs y herramientas de desarrollo</li><li>Uso de servicios como EC2, S3, RDS, SNS, Lambda, Docker, Kubernetes, Terraform, Grafana</li><li>Desarrollo de elementos software para gestión de sistemas, para tareas administrativas de sistemas, y para el manejo de dispositivos (drivers)</li><li>Con certificaciones en AWS Cloud Practitioner y Developer Associate</li></ul>",
  "RS2_": "10/2023 - 03/2024<br>Curso de desarrollador web para Microsoft Azure<br>Centro Tajamar (400 h)",
  "RC2_": "<ul><li>Desarrollo web mediante .NET con ASP.NET Core: MVC, Razor pages, Blazor y API RESTful.</li><li>Desarrollo en la nube de Azure con servicios como: Azure VM, App Service, SQL DataBase, Blob Storage, Active Directory, Functions, Cosmos DB y Azure DevOps.</li><li>Con certificaciónes en Azure Fundamentals y Azure Administrator Associate.</li></ul>",
  "RS2__": "09/2021 - 07/2023<br>Título de FP Grado Superior “Técnico Superior en Desarrollo de Aplicaciones Multiplataforma (DAM)”<br>Universidad Alfonso X El Sabio",
  "RC2__": "<ul><li>Programación orientada a objetos Java, C# y PHP.</li><li>Desarrollo de aplicaciones móviles para Android usando Android Studio</li><li>Programación web con HTML, CSS, JavaScript y Bootstrap.</li></ul>",
  "RT3": "Metodologías",
  "RS3": "Diseño",
  "RC3": "<ul><li>Modelo Vista Controlador</li><li>Prioridad UX (experiencia de usuario)</li><li>Encapsulación e inyección de dependencias</li><li>Metodologías ágiles (Scrum y Kanban)</li><li>Diseño adaptativo (móviles)</li><li>Diseño bilingüe (español/inglés)</li></ul>",


  "PS1": "Download my CV in pdf",
  "PC1": "<a href=assets/CV-es.pdf><img src= 'assets/CV-es.gif'></a>",
  "PT2": "Available services",  
  "PS2": "Cloud Solutions",
  "PC2": "Development of scalable and secure cloud solutions with Azure, including the implementation of microservices, serverless functions and database management.",
  "PS2_": "Fullstack Web Design",
  "PC2_": "I offer complete web design and development services, using technologies such as HTML, CSS, JavaScript, .NET and PHP to create dynamic, responsive and SEO optimized websites.<br>Consulting and training services in web and development technologies, helping teams to improve their skills and adopt new technologies effectively.<br>",
  "PS2__": "Mobile apps",
  "PC2__": "Design and development of mobile applications for Android, ensuring an intuitive user experience and advanced functionality using technologies such as React Native and Xamarin.<br><br><hr>I offer my professional multi-platform programming and development services to any company or individual in Spain or abroad. I can develop dynamic and attractive web pages in a matter of hours (50 €/h).",

  "PT3": "Portfolio",  
  "PS3": "Web Sites",
  "PC3": "Microservices for a product management website (<a href='https://github.com/eduardomarraz/-Microservicio_Productos_Hecho'>GitHub repo</a>).<br>Website developed with .NET with ASP.NET Core: Razor pages with SQL Server, connected to Azure through a Messaging Bus in which the subscribed emails receive the messaging.<br>Example website of name management in SQLServer with MVC (GitHub repo).<br>Example book management website with access limited to registered users, in MVC with the Identity framework (GitHub repo), and in Angular with API (GitHub repo).<br>The present personal web, in Angular (GitHub repo).",
  "PS3_": "Mobile apps",
  "PC3_": "Game for memorization of technical terms, in Android (<a href='https://github.com/eduardomarraz/Android-App-for-learning-and-memorization'>GitHub repo</a>).<br>Developing from scratch an Android app to help memorize flashcards of the Android system itself, the app is autonomous (stand-alone) for individual learning of advanced technical concepts.<br>Demonstration app for managing student enrollment in subjects (GitHub repo).",
  "PS3__": "Cloud developments",
  "PC3__": "Automatization in AWS con Docker, CloudWatch, Lambda, SNS y EC2 (<a href='https://github.com/eduardomarraz/AWS-Automation-with-Dockers-CloudWatch-Lambda-SNS-and-EC2'>GitHub repo</a>).<br>.<br>Project carried out in AWS through Cloud9 using Linux commands, for the automation of messages using CloudWatch metrics and alarms, establishing that as the docker containers suffer an unexpected crash or failure, they have an automated creation according to the adjustment of the metrics, for example when CPU is above 70%.",

  "CT1-1": "<center><img src='assets/blog1.jpg' alt='Azure' height='300px'></center>",
  "CT1-2": "<center><img src='assets/blog2.jpg' alt='Azure' height='300px'></center>",
  "CT1-3": "<center><img src='assets/blog3.jpg' alt='Azure' height='300px'></center>",
  "CT1-4": "<center><img src='assets/blog4.jpg' alt='Azure' height='300px'></center>",

  "CT2-1": "Microsoft Certified: Azure Fundamentals",
  "CS2-1": "<a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_microsoft-certified-azure-fundamentals-was-activity-7178001560566710272-jt5K?utm_source=share&utm_medium=member_desktop' alt='MS'>Issued by Microsoft</a>",
  "CC2-1": "Azure Fundamentals certification winners have demonstrated advanced-level knowledge of cloud services and how those services are delivered with Microsoft Azure.<br>Knowledge Gained: Azure, Cloud Data, Cloud Networking, Cloud Security, Cloud Services, Cloud Storage, Virtualization",

  "CT2-2": "<br><br>WS Certified Cloud Practitioner",
  "CS2-2": "<pre><pre><a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_aws-academy-graduate-aws-academy-cloud-activity-7192202950692290560-6Iif?utm_source=share&utm_medium=member_desktop' alt='AWS'>Issued by Amazon Web Services Training and Certification</a></pre></pre>",
  "CC2-2": "Winners of this certification have advanced knowledge of IT services and their uses in the AWS cloud. They demonstrated cloud fluency and fundamental knowledge of AWS. Badge holders can identify the essential AWS services required to set up AWS-centric projects.<br>Knowledge Gained: Amazon Web Services, AWS Cloud, AWS Certification, Cloud Computing, Cloud Plataform, Cloud Storage, Virtualization",

  "CT2-3": "<br><br>Agile Explorer",
  "CS2-3": "<pre><pre><a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_agile-explorer-was-issued-by-ibm-skillsbuild-activity-7134545402166456320-j9rZ?utm_source=share&utm_medium=member_desktop' alt='AWS'>Issued by IBM SkillsBuild</a></pre></pre>",
  "CC2-3": "The earner of this credential has a fundamental understanding of agile values, principles, and practices that help change the culture and behaviors in the way people work. The individual can initiate an agile conversation with team members and colleagues, and can apply the agile method to operations and work programs carried out in a family, academic or work environment",

  "CT2-4": "<br>Artificial Intelligence Fundamentals",
  "CS2-4": "<pre><pre><a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_artificial-intelligence-fundamentals-was-activity-7146881578009350144-Zc1t?utm_source=share&utm_medium=member_desktop' alt='AWS'>Issued by IBM SkillsBuild</a></pre></pre>",
  "CC2-4": "The person who earns the credential demonstrates knowledge of artificial intelligence (AI) concepts, such as natural language processing, computer vision, machine learning, deep learning, chatbots, and neural networks; AI Ethics; and AI applications. The individual has a conceptual understanding of how to run an AI model using IBM Watson Studio. Whoever wins knows the job prospects in fields that use AI and is familiar with the skills necessary to succeed in various roles in the domain.",

  "KT1": "You can contact me on: (ADD ICONS):",
  "KS1": "<b>Email</b>: eduardomr_@hotmail.com.<br><b>Phone</b>: +(34) 649770726.<br><b>Linkedin</b>: https://www.linkedin.com/in/eduardo-martinez-ramirez/.<br><b>GitHub</b>: https://github.com/eduardomarraz.<br><b>DockerHub</b>: https://hub.docker.com/eduardomarraz.<br><b>My living quarters</b>: Barrio del Pilar - Madrid"
}
