{
  "HOME": "Inicio",
  "RESUME": "Resumen",
  "PORTFOLIO": "Portafolio",
  "CERT": "Certificacioness",
  "CONTACT": "Contacto",
  "FOOT": "<hr>&copy; 2024 Creado en Angular por Eduardo Martínez Ramírez",
  "TITLE": "¡Hola!, soy <b><i>Eduardo Martínez</i></b>. Bienvenido a mi web",

  "HT1": "<a href='assets/Edi-1.jpg' alt='Eduardo'>¿Quién soy?</a>",
  "HS1": "Soy un desarrollador web y multiplataforma en nube",
  "HC1": "Mi especialidad abarca la creación de sitios web dinámicos y el desarrollo de aplicaciones para diversas plataformas. Siempre estoy buscando oportunidades para expandir mis habilidades y enfrentar nuevos desafíos en el campo de la tecnología informática<.br>Hago todo el ciclo de desarrollo, desde la concepción del diseño de la parte visible (<i>frontend</i>), a la gestión de las bases de datos de negocio (<i>backend</i>), pasando por todas las etapas de desarrollo de la lóguca distribuída entre el servidor y el cliente.<br><br>Tengo iniciativa en la resolución de problemas complejos. Se me da bien el trabajo colaborativo, y tengo experiencia en continuar desarrollos ajenos.<br><br>Soy español, nacido en Madrid el 23 de agosto de 1992.",
  "HT2": "Conocimientos",
  "HS2": "Desarrollador Web Full-stack",
  "HC2": "Desarrollo Front-end con Webs dinámicas con Angular, React y Nodejs.<br>Programación Back-End con .NET, C#, Java, PHP.",
  "HT2_": "",
  "HS2_": "Programación de Sistemas informaticos en nubes AWS y Azure",
  "HC2_": "Programación con .NET, C#, Java, PHP y bases de datos MySQL, SQLServer, SQlite.",
  "HT2__": "",
  "HS2__": "Desarrollador de aplicaciones multiplataforma",
  "HC2__": "Diseño de aplicaciones para móviles con Android..",
  
  "HT3": "Habilidades",
  "HS3": "Tengo experiencia en <u>add ICONS</u>:",
  "HC3": "<ul><li>.NET y C#</li><li>Java y Spring</li><li>HTML, CSS y Bootstrap</li><li>JS, Node.js y Angular</li><li>APIs y Postman</li><li>PHP y WordPress</li><li>Android</li><li>Python</li><li>SQLServer, MySQL, SQLite y MongoDB</li><li>Git, GitHub y GH-Pages</li><li>AWS y Azure</li><li>Me mantengo actualizado en los progresos del HW (sobre todo de tarjetas gráficas), y del SW de IA y videojuegos</li></ul>",

  "RT1": "Experiencia",
  "RS1": "04/2023 - 09/2023<br>Desarrollador full-stack en <i><b><u>intuye</u></b></i>",
  "RC1": "Desarrollo de un gestor documental con PHP, HTML, CSS y JavaScript con las siguientes funcionalidades<br><ul><li>Implementando una plataforma web con funciones de registro y autenticación vinculada a una base de datos MySQL mediante XAMPP.</li><li>Diseñando un sistema de gestión de usuarios con roles y privilegios personalizables.</li><li>Creación de un gestor de archivos, que permite: subir, borrar, ordenar, etiquetar archivos.</li></ul>",
  "RC1_": "Desarrollo de una web de comercio electrónico con .NET Core 6 y Azure <br><ul><li>ImplUtilizando ASP.NET Core y Razor Pages, implementando una arquitectura de microservicios con Azure y gestión de Apis mediante Postman.</li><li>Usando Azure Functions para la implementación de funciones serverless, reduciendo el coste de infraestructura..</li></ul>",

  "RT2": "Estudios profesionales",
  "RS2": "03/2024 - 07/2024<br>Curso de programador de sistemas en AWS<br>Centro Tajamar (510 h)",
  "RC2": "<ul><li>Desarrollo de aplicaciones en la nube utilizando AWS SDKs y herramientas de desarrollo</li><li>Uso de servicios como EC2, S3, RDS, SNS, Lambda, Docker, Kubernetes, Terraform, Grafana</li><li>Desarrollo de elementos software para gestión de sistemas, para tareas administrativas de sistemas, y para el manejo de dispositivos (drivers)</li><li>Con certificaciones en AWS Cloud Practitioner y Developer Associate</li></ul>",
  "RS2_": "10/2023 - 03/2024<br>Curso de desarrollador web para Microsoft Azure<br>Centro Tajamar (400 h)",
  "RC2_": "<ul><li>Desarrollo web mediante .NET con ASP.NET Core: MVC, Razor pages, Blazor y API RESTful.</li><li>Desarrollo en la nube de Azure con servicios como: Azure VM, App Service, SQL DataBase, Blob Storage, Active Directory, Functions, Cosmos DB y Azure DevOps.</li><li>Con certificaciónes en Azure Fundamentals y Azure Administrator Associate.</li></ul>",
  "RS2__": "09/2021 - 07/2023<br>Título de FP Grado Superior “Técnico Superior en Desarrollo de Aplicaciones Multiplataforma (DAM)”<br>Universidad Alfonso X El Sabio",
  "RC2__": "<ul><li>Programación orientada a objetos Java, C# y PHP.</li><li>Desarrollo de aplicaciones móviles para Android usando Android Studio</li><li>Programación web con HTML, CSS, JavaScript y Bootstrap.</li></ul>",
  "RT3": "Metodologías",
  "RS3": "Diseño",
  "RC3": "<ul><li>Modelo Vista Controlador</li><li>Prioridad UX (experiencia de usuario)</li><li>Encapsulación e inyección de dependencias</li><li>Metodologías ágiles (Scrum y Kanban)</li><li>Diseño adaptativo (móviles)</li><li>Diseño bilingüe (español/inglés)</li></ul>",


  "PS1": "Descarga mi CV en pdf",
  "PC1": "<a href=assets/CV-es.pdf><img src= 'assets/CV-es.gif'></a>",
  "PT2": "Servicios disponibles",  
  "PS2": "Soluciones en la Nube",
  "PC2": "Desarrollo de soluciones escalables y seguras en la nube con Azure, incluyendo la implementación de microservicios, funciones serverless y gestión de bases de datos.",
  "PS2_": "Diseño Web Fullstack",
  "PC2_": "Ofrezco servicios completos de diseño y desarrollo web, utilizando tecnologías como HTML, CSS, JavaScript, .NET y PHP para crear sitios web dinámicos, receptivos y optimizados para SEO.<br>Servicios de consultoría y formación en tecnologías web y de desarrollo, ayudando a equipos a mejorar sus habilidades y adoptar nuevas tecnologías de manera efectiva.<br>",
  "PS2__": "Aplicaciones Móviles",
  "PC2__": "Diseño y desarrollo de aplicaciones móviles para Android, asegurando una experiencia de usuario intuitiva y funcionalidad avanzada utilizando tecnologías como React Native y Xamarin.<br><br><hr>Ofrezco mis servicios profesionales de programación y desarrollo multiplataforma a cualquier empresa o particular de España o del extranjero. Puedo desarrollar páginas web dinámicas y atractivas en cuestión de horas (a 50 €/h).",

  "PT3": "Realizaciones",  
  "PS3": "Sitios Web",
  "PC3": "Microservicios para una web de gestión de productos (<a href='https://github.com/eduardomarraz/-Microservicio_Productos_Hecho'>GitHub repo</a>).<br>Web desarrollada con .NET con ASP.NET Core: Razor pages con en SQL Server, conectada a Azure mediante un Bus de Mensajeria en el cual los email suscritos reciben la mensajería.<br>Web de ejemplo de gestión de nombres en SQLServer con MVC (GitHub repo).<br>Web de ejemplo de gestión de libros con acceso limitado a usuarios registrados, en MVC con el marco Identity (GitHub repo), y en Angular con API (GitHub repo).<br>Esta web personal en Angular (GitHub repo).",
  "PS3_": "Aplicaciones móviles",
  "PC3_": "Juego de memorización de términos técnicos en Android (<a href='https://github.com/eduardomarraz/Android-App-for-learning-and-memorization'>GitHub repo</a>).<br>Desarrollando desde cero una app en Android de ayuda a la memorización por flashcards del propio sistema Android, la app es autónoma (stand-alone) para el aprendizaje individual de conceptos técnicos avanzados.<br>App de demostración de manejo de matrícula de alumnos en asignaturas (GitHub repo).",
  "PS3__": "Desarrollos en nube",
  "PC3__": "Automatización en AWS con Docker, CloudWatch, Lambda, SNS y EC2 (<a href='https://github.com/eduardomarraz/AWS-Automation-with-Dockers-CloudWatch-Lambda-SNS-and-EC2'>GitHub repo</a>).<br>.<br>Proyecto realizado en AWS a través de Cloud9 mediante comandos Linux, para la automatización de mensajes mediante las métricas y alarmas de CloudWatch estableciendo que conforme los contenedores docker sufran alguna caída o fallo imprevisto tengan una creación automatizada según el ajuste de las métricas, por ejemplo cuando la CPU este por encima del 70%..",

  "CT1-1": "<center><img src='assets/blog1.jpg' alt='Azure' height='300px'></center>",
  "CT1-2": "<center><img src='assets/blog2.jpg' alt='Azure' height='300px'></center>",
  "CT1-3": "<center><img src='assets/blog3.jpg' alt='Azure' height='300px'></center>",
  "CT1-4": "<center><img src='assets/blog4.jpg' alt='Azure' height='300px'></center>",

  "CT2-1": "Microsoft Certified: Azure Fundamentals",
  "CS2-1": "<a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_microsoft-certified-azure-fundamentals-was-activity-7178001560566710272-jt5K?utm_source=share&utm_medium=member_desktop' alt='MS'>Issued by Microsoft</a>",
  "CC2-1": "Los ganadores de la certificación Azure Fundamentals han demostrado un conocimiento de nivel avanzado de los servicios en la nube y cómo se brindan esos servicios con Microsoft Azure.<br>Conocimientos adquiridos:Azure, Cloud Data, Cloud Networking, Cloud Security, Cloud Services, Cloud Storage, Virtualization",

  "CT2-2": "<br><br>WS Certified Cloud Practitioner",
  "CS2-2": "<pre><pre><a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_aws-academy-graduate-aws-academy-cloud-activity-7192202950692290560-6Iif?utm_source=share&utm_medium=member_desktop' alt='AWS'>Issued by Amazon Web Services Training and Certification</a></pre></pre>",
  "CC2-2": "Los ganadores de esta certificación tienen un conocimiento avanzado de los servicios de TI y sus usos en la nube de AWS. Demostraron fluidez en la nube y conocimiento fundamental de AWS. Los propietarios de insignias pueden identificar los servicios esenciales de AWS necesarios para configurar proyectos centrados en AWS.<br>Conocimientos adquiridos:Amazon Web Services, AWS Cloud, AWS Certification, Cloud Computing, Cloud Plataform, Cloud Storage, Virtualization",

  "CT2-3": "<br><br>Agile Explorer",
  "CS2-3": "<pre><pre><a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_agile-explorer-was-issued-by-ibm-skillsbuild-activity-7134545402166456320-j9rZ?utm_source=share&utm_medium=member_desktop' alt='AWS'>Issued by IBM SkillsBuild</a></pre></pre>",
  "CC2-3": "Esta persona que obtuvo la credencial tiene una comprensión fundamental de los valores, principios y prácticas ágiles que ayudan a cambiar la cultura y los comportamientos en la forma en que trabajan las personas. El individuo puede iniciar una conversación ágil con miembros del equipo y colegas, y puede aplicar el método ágil a las operaciones y programas de trabajo que realiza en un entorno familiar, académico o laboral",

  "CT2-4": "<br>Artificial Intelligence Fundamentals",
  "CS2-4": "<pre><pre><a href='https://www.linkedin.com/posts/eduardo-martinez-ramirez_artificial-intelligence-fundamentals-was-activity-7146881578009350144-Zc1t?utm_source=share&utm_medium=member_desktop' alt='AWS'>Issued by IBM SkillsBuild</a></pre></pre>",
  "CC2-4": "Esta persona que obtiene la credencial demuestra conocimiento de conceptos de inteligencia artificial (IA), como procesamiento del lenguaje natural, visión por computadora, aprendizaje automático, aprendizaje profundo, chatbots y redes neuronales; Ética de la IA; y las aplicaciones de la IA. El individuo tiene una comprensión conceptual de cómo ejecutar un modelo de IA utilizando IBM Watson Studio. Quien gana conoce las perspectivas laborales en campos que utilizan IA y está familiarizado con las habilidades necesarias para tener éxito en diversos roles en el dominio.",

  "KT1": "Puedes contactar conmigo en (ADD ICONS):",
  "KS1": "<b>Email</b>: eduardomr_@hotmail.com.<br><b>Teléfono</b>: +(34) 649770726.<br><b>Linkedin</b>: https://www.linkedin.com/in/eduardo-martinez-ramirez/.<br><b>GitHub</b>: https://github.com/eduardomarraz.<br><b>DockerHub</b>: https://hub.docker.com/eduardomarraz.<br><b>Dirección</b>: Barrio del Pilar - Madrid"
}
